src/test/resources/maps/request-updatelayer.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://servicemix.apache.org/samples/wsdl-first/types">
    <env:Body>
        <map:UpdateLayerRequest xmlns:map="http://uicds.org/MapService"
            xmlns:precisb="http://www.saic.com/precis/2009/06/base" xmlns:preciss="http://www.saic.com/precis/2009/06/structures">
            <preciss:WorkProductIdentification>
                <precisb:Identifier>test</precisb:Identifier>
                <precisb:Version>1</precisb:Version>
                <precisb:Type>Layer</precisb:Type>
                <precisb:Checksum>111</precisb:Checksum>
            </preciss:WorkProductIdentification>
            <Layer xmlns="http://www.opengis.net/context" xmlns:xlink="http://www.w3.org/1999/xlink"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xsi:schemaLocation="http://www.opengis.net/context http://schemas.opengis.net/context/1.0.0/context.xsd"
                queryable="1" hidden="1" proxied="0" opacity="1.0" viewRefreshMode="never"
                viewRefreshTime="1">
                <Server service="WMS" version="1.1.1" title="World Map">
                    <OnlineResource type="simple"
                        xlink:href="http://www2.demis.nl/wms/wms.asp?wms=WorldMap" />
                </Server>
                <StyleList>
                    <Style>
                        <Name>#default</Name>
                        <Title>Default Style</Title>
                    </Style>
                </StyleList>
                <SRS>EPSG:4326</SRS>
                <Name>Bathymetry</Name>
                <Title>Bathymetry</Title>
            </Layer>
        </map:UpdateLayerRequest>
    </env:Body>
</env:Envelope>